// Smile:
// 0001110000111000
// 0001110000111000
// 0001110000111000
// 0000000000000000
// 0000000000000000
// 0110000000000110
// 0011100000011100
// 0000111111110000

// R0 == top*32 + left/16

@SCREEN
D = A
@address
M = D // Указатель на начало экрана

@R0
D = M
@address
M = M + D // Смещение в нужную точку

// Отрисовка смайла

// Для первых трёх строк смайла возможно было сделать цикл, но по количеству инструкций мы не сильно выиграем, т.к кол-во итераций = 3
@7224 // 0001110000111000
D = A
@address
A = M
M = D

@32 // Переходим на след. строку смайла
D = A
@address
M = M + D

@7224 // 0001110000111000
D = A
@address
A = M
M = D

@32 // Переходим на след. строку смайла
D = A
@address
M = M + D

@7224 // 0001110000111000
D = A
@address
A = M
M = D

// Имеем 0001110000111000
//       0001110000111000
//       0001110000111000

@96 // Переходим на след. строку смайла
D = A
@address
M = M + D
// Имеем 0001110000111000
//       0001110000111000
//       0001110000111000
//       0000000000000000
//       0000000000000000

@24582 // 0110000000000110
D = A
@address
A = M
M = D

@32 // Переходим на след. строку смайла
D = A
@address
M = M + D

@14364 // 0011100000011100
D = A
@address
A = M
M = D

@32 // Переходим на след. строку смайла
D = A
@address
M = M + D

@4080 // 0000111111110000
D = A
@address
A = M
M = D
// Имеем 0001110000111000
//       0001110000111000
//       0001110000111000
//       0000000000000000
//       0000000000000000
//       0110000000000110
//       0011100000011100
//       0000111111110000
(END)
@END
0;JMP